In [1]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\venv\myproject\lib\site-packages (1.0.2)

In [3]:
import pymysql

In [13]:
# pymqsql 모듈을 통해 db connect한 후 cursor() 오브젝트를 통해 execute(명령어 ex)create... ) 실행 
# 데이터베이스 연결
db = pymysql.connect(host='localhost', 
                    user = 'root', 
                    password = 'password', 
                    db = 'pydata', 
                    charset = 'utf8')
curs = db.cursor()

In [7]:
# 테이블 생성 : sample(col1, col2, col3)
sql = '''create table sample(
        col1 varchar(50), 
        col2 varchar(50), 
        col3 varchar(50))'''
curs.execute(sql)

0

In [8]:
sql = 'select * from sample'
curs.execute(sql)

rows = curs.fetchall()
print(rows)

()

In [ ]:
# 데이터 삽입 : insert into 테이블명 (컬럼명, ..) values (값, ..)
sql = '''insert into sample (col1, col2, col3)
        values ('test1', 'test2', 'test3')'''
curs.execute(sql)

sql = 'select col1, col2 from sample'
curs.execute(sql)

rows = curs.fetchall() # cursor의 결과 한꺼번에 가져옴
print(rows)

db.commit()

In [20]:
for row in rows:
    for _ in range(len(row)):
        print(row)

('test1', 'test2')
('test1', 'test2')
('test1', 'test2')
('test1', 'test2')
('test1', 'test2')
('test1', 'test2')

In [21]:
import pandas as pd
df = pd.DataFrame(rows)
df

       0      1
0  test1  test2
1  test1  test2
2  test1  test2

In [22]:
df.columns = ['col1', 'col2']
df

    col1   col2
0  test1  test2
1  test1  test2
2  test1  test2

In [ ]:
# 데이터 수정 : update 테이블명 set 컬럼명 = 값, .. wh
sql = '''update sample set
        col1 = 'cc, col2 = 'bb'
        where coll = 'a')
        '''
curs.execute(sql)

sql = 'select * from sample'
curs.execute(sql)

rows = curs.fetchall()  # 데이터 가져오기
print(rows)

db.commit()

In [ ]:
# 데이터 삭제 : delete from 테이블명 where 컬럼명 = 값
sql = '''
    delete from sample
    where coll = 'cc'
'''
curs.execute(sql)

In [12]:
db.close()  # 데이터 연결 끊기 위해 마지막에 선언